// ______________________________________________________________________________________________
// 1. Використовуючи методи об'єкту Date створити функцію, яка буде повертати і виводити в консолі поточний час (в момент виклику функції) у відповідному форматі
//  09:15:56, середа , 06 травня 2020 року (1 бал)

let date = new Date();
const options = {
    weekday: 'long',
    year: 'numeric',
    month: 'long',
    day: 'numeric',
};
let time = date.toLocaleTimeString()
console.log(`${time}, ${date.toLocaleString("uk-UA", options)}`)
        
// ______________________________________________________________________________________________
// 2. Використовуючи функції для створення модальних вікон prompt, alert, confirm і об'єкт Math, розробити додаток-гру “Вгадай число”. Користувачу надається право вгадати число з діапазону від 0 до 100, яке програма генерує випадково. Якщо користувач не вгадав, додаток вказує наскільки користувач відхилився від загаданого числа і запропонує вгадати ще раз. Відхилення вів діапазону визначати фразами “холодно”, “гаряче”, “дуже холодно”, “дуже гарячу”, “холодніше”, “тепліше” тощо.
	// Якщо користувач вгадав число з діапазону  то йому виводиться повідомлення про кількість спроб, які йому знадобилися для вгадування вірного значення, а також саме число яке потрібно було вгадати. Наприклад “За 10 спроб ви вгадали число 33”. І потім задається запитання спробувати ще раз зіграти в гру. Якщо відповідь позитивне, то процес починається з початку.
	// Кожну спроба супроводжувати в консолі наступним текстом
 	// “02.03.2020 16:01:33 Спроба 1: число 23 – не вірно” (1 бал)

    let rand = Math.round(Math.random() * (1+99))
    let isTrue = true;
    let counter = 0;
    while(isTrue == true){
        let number = +prompt('enter your number')
        counter++;
    if(number === rand){
        isTrue = false;
        console.log(`Ви витратили ${counter} спроб і ваше число: ${number}`)
    }
    else if (Math.abs(rand - number) <= 3) {
        alert('Гаряче')
        console.log(`${time} Спроба ${counter}: число ${number} - не вірно`)
    }
    else if (Math.abs(rand - number) > 3 && Math.abs(rand - number) <= 5) {
        alert('Тепло')
        console.log(`${time} Спроба ${counter}: число ${number} - не вірно`)
    }
    else if (Math.abs(rand - number) > 5 && Math.abs(rand - number) <= 10) {
        alert('Холодно')
        console.log(`${time} Спроба ${counter}: число ${number} - не вірно`)
    }
    else if (Math.abs(rand - number) > 10) {
        alert('Дуже холодно')
        console.log(`${time} Спроба ${counter}: число ${number} - не вірно`)
    }
    }
        