// З допомогою циклу while вивести всі прості числа в проміжку від 0 до 100
let nums = [];

let i = 0;

let res = [];

while (i < 100) {
    nums.push(i);
    i++;
}

for (let i = 1; i <= nums.length; i++) {
    let flag = 1;
    for (let n = 2; (n <= i / 2) && (flag == 1); n = n + 1) {
        if (i % n == 0) {
            flag = 0
        }
    }
    if (flag == 1) { res.push(i); }
}

console.log(res);
// ________________________________________________________________________________________________________________________________________________________
// З допомогою циклу do…while написати функцію для виведення чисел від 0 до 10, щоб результат виводу був відповідний зразку:
// 	 0 – це нуль
// 	 1 – непарне число
// 	 2 – парне число
// 	 3 – непарне число
//    		…
// 	 10 – парне число

 let number = 0;

    do {
        if (number === 0) {
            console.log(number + " – це нуль");
        } else if (number % 2 === 0) {
            console.log(number + " – парне число");
        } else {
            console.log(number + " – непарне число");
        }
        number++;
    } while (number <= 10);

// ________________________________________________________________________________________________________________________________________________________
// Дано число numb = 10000. Діліть його на 2 стільки раз, поки результат ділення не стане менше 50. Число яке отримаєте, запишіть в змінну result. Порахуйте кількість ітерацій,  необхідних для цього і запишіть її в змінну counter. Результат записаний в змінні result і counter виведіть в консолі.

let numb = 10000;
let counter = 0;

while (numb >= 50) {
    numb /= 2;
    counter++;
}

let result = numb;

console.log("Результат:", result);
console.log("Кількість ітерацій:", counter);

// ________________________________________________________________________________________________________________________________________________________
// В змінній month лежить якесь число з діапазону від 1 до 12. Визначте в яку пору року потрапляє цей місяць (зима, літо, весна, осінь) і яку цей місяць має назву. Число з діапазону отримувати з допомогою модального вікна prompt, результат роботи виводити в модальному вікні alert.
let month = +prompt('Введіть номер місяця');

if(month >=1 && month < 3 || month === 12){
    alert('Зима')
}else if(month >= 3 && month < 6){
    alert('Весна')
}else if(month >= 6 && month <= 9){
    alert('Літо')
}else if(month >= 9 && month < 12){
    alert('Осінь')
}else{
    alert('Такої пори року не існує')
}

// ________________________________________________________________________________________________________________________________________________________
// Задати температуру в градусах за Цельсієм. Вивести в alert відповідну температуру в градусах за Фаренгейтом. Підказка: розрахунок йде за формулою: Tf = (9/5)*Tc + 32, де Tf – температура за Фаренгейтом, Tc – температура за Цельсієм.

let temp = +prompt('Вкажіть температуру')

alert(temp * 9 / 5 + 32)

// ________________________________________________________________________________________________________________________________________________________
// Отримати з модального вікна prompt число від 1 до 7, і вивести в вікні браузера день неділі, якому відповідає задане число.

let day = +prompt('Введніть номер ')

switch (day){
case 1:
    alert('Monday')
    break;
case 2:
    alert('Tuesday')
    break;
case 3:
    alert('Wednesday')
    break;
case 4:
    alert('Thursday')
    break;
case 5:
    alert('Friday')
    break;
case 6:
    alert('Saturday')
    break;
case 7:
    alert('Sunday')
    break;
default:
    alert('Wrong number')
    
}

